Revit 2024 API
BuiltInFailures.HvacFailures Class
 Failures related to HVAC in MEP.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class HvacFailures
Visual Basic
Public NotInheritable Class HvacFailures
Visual C++
public ref class HvacFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.HvacFailures
See Also
BuiltInFailures.HvacFailures Members
Autodesk.Revit.DB Namespace